package bot.finalVariables;

public class MessageTexts {

    public static final String START_MESSAGE =
            "<b>Привет! Я бот, который поможет тебе заработать денег. " +
            "Краткое описание этапов к получению выплаты:</b>\n\n" +
            "1. Выбор сферы (банки, работы и др.)\n" +
            "2. Выбор компании в указанной сфере\n" +
            "3. Выбор конкретного предмета в компании\n" +
            "4. Оформление и выполнение условий\n" +
            "5. Получение вознаграждения\n\n" +
            "<b>Админ:</b> @neyarex\n<b>" +
            "Правила сообщества:</b> @smich_rules";
    public static final String MAIN_MANU_MESSAGE =
            "<b>Главное меню. Выбери кнопку из списка ниже:</b>\n\n" +
            "• <b>Welcome</b> - выбор сферы\n" +
            "• <b>SMICH</b> - основной канал\n" +
            "• <b>Bimarium</b> - канал бота\n" +
            "• <b>SMICH | Welcome</b> - канал реферальных систем";
    public static final String WELCOME_MESSAGE =
            "<b>Welcome. Выбери сферу:</b>\n\n" +
            "• <b>Банки</b> - оформление банковского продукта\n" +
            "• <b>Работы</b> - трудоустройство\n\n" +
            "Все сферы подразумевают выполнение определённых " +
            "условий для получения вознаграждения";
    public static final String BANKS_MESSAGE =
            "<b>Банки. Выбери банк:</b>\n\n" +
            "• <b>Т-Банк</b> - большое количество продуктов, но " +
            "<b>денежное</b> вознаграждение существует далеко не за каждый из них\n" +
            "• <b>Альфа-банк</b> - продуктов не так много, как в Т-Банке, " +
            "но некоторую сумму денег можно получить за любой оформленный продукт";
    public static final String T_BANK_MESSAGE =
            "<b>Т-Банк. Выбери продукт:</b>\n\n" +
            "Ниже представленны почти все продукты, за которые можно получить " +
            "денежное вознаграждение. За какие-то из них деньги получаю только я, " +
            "но в любом случае мы всё делим 50/50.\n" +
            "Помимо указанного, дежное вознаграждение можно получить за:\n\n" +
            "• Авиабилеты (1000р)\n" +
            "• Кредит наличными (5000р)\n" +
            "• Кредит наличными под залог недвижимости или авто (3000р)\n" +
            "• Рефинансирование кредитов (1000р)\n" +
            "• Автокредит (5000р)\n" +
            "• Страхование ипотеки (1500р)\n\n" +
            "Эти и другие продукты вы можете найти, перейдя по ссылке " +
            "кнопки \"Выбрать продукт\".\n\n<b>Обратите внимание:</b> " +
            "за любые другие продукты денежное вознаграждение <b>не предусмотренно</b>!";
    public static final String ALFA_BANK_MESSAGE =
            "<b>Альфа-Банк. Выбери продукт:</b>\n\n" +
            "...";
    public static final String WORKS_MESSAGE = "Выбери работу:";
}
